<?php
//题目:  输出 100 以内(不含 100 )能被 3 整除的所有整数
/* for($i=1;$i<=100;$i+=1){
    if($i%3 == 0){
        echo $i,"<br/>";
    }
} */


// 题目: 输出 100 以内(不含 100 )能被 3 整除且个位数为 6 的所有整数
/* for($i=1;$i<=100;$i++){
    if($i%3==0 && $i%10==6)
    echo $i,"<br/>";
} */


// 题目: 输出 1 ~ 100(不包含100) 之间的偶数， 5 个数字一行输出
/* for($i=1,$n=0;$i<100;$i++){
    if($i%2 == 0){
        echo $i;
        $n+=1;
        if($n%5 == 0){
            echo "<br/>";
        }
    }
} */



// 题目: 操场上100多人排队,3人一组多1人,4人一组多2人,5人一组多3人,共多少人?
/* for($i=100;$i<200;$i++){
    if($i%3 == 1 && $i%4 == 2 && $i%5==3){
    echo $i,'<br>';
    }
}
 */


 //题目:打印0-300(不含300)不含4的所有自然数
/*  for($i=0;$i<3;$i+=1){
     for($j=0;$j<10;$j++){
         for($k=0;$k<10;$k++){
             if($i!=4 && $j!=4 && $k!=4){
                 echo $i*100+$j*10+$k,'<br/>';
             }
         }
     }
 }
 */




// 题目的意思是， 公鸡 5 文钱 1 只， 母鸡 3 文钱 1 只， 小鸡 1 文钱买 3 只， 现在用 100文钱共买了 100 只鸡，
// 问： 在这 100 只鸡中， 公鸡、 母鸡 和小鸡各是多少只？ （ 设每种至少 一只）
/* for($m=1;$m<=31;$m++){
    for($g=1;$g<=18;$g++){
        $s=100-$m-$g;
        if(($m*3+$g*5+$s/3)==100){
            echo '公鸡',$g,'只,母鸡',$m,'只,小鸡',$s,'只<br />';
        }
    }
} */


// 题目: 两个自然数相除,商3余10,被除数,除数,商,余数的和是163,求被除数,除数.
//假设除数是$i
/* for($i=0;$i<163;$i+=1){
    //被除数$ix3+10
    if($i*3+10+$i+3+10 == 163){
        echo '除数:',$i,'被除数:',$i*3+10;
    }
} */


// 题目: 一只猴子旁边有100根香蕉 猴子距离家50米 猴子一次顶多搬50根香蕉 但猴子每走一米就要吃掉一根香蕉 问
// 猴子最多能拿多少根香蕉回家
/* $b = 100;
for($i=1;$i<=50;$i++){
    if($b>50){
        $b -=3;
    }else{
        $b--;
    }
    echo '剩余香蕉数为:',$b,'剩余路程为:',(50-$i),'<br>';
}
 */
// 题目: 所谓"水仙花数"是指一个三位数,其各位数字的立方和等于该数本身
// 例如:371是一个"水仙花数",因为 371=3x3x3+7x7x7+1x1x1
/* for($i=1;$i<10;$i++){
    for($j=0;$j<10;$j++){
        for($k=0;$k<10;$k++){
            if($i*$i*$i+$j*$j*$j+$k*$k*$k == $i*100+$j*10+$k){
                echo $i*100+$j*10+$k,"<br/>";
            }
        }
    }
} */






// 题目: 假设某人有 100,000 现金。每经过一次路口需要进行一次交费。
// 交费规则为当他现金大于 50,000 时每次需要交 5%如果现金小于等于 50,000 时每次交 5,000。
// 请写一程序计算此人可 以经过多少次这个路口。
/* for($i = 1,$money=100000;$money>=5000;$i+=1){
    if($money>50000){
        $money -= $money*0.05;
    }else if($money<=50000){
        $money -=5000;
    }
    echo "第",$i,"次过路口，剩下",$money,"元<br/>";
}
 */























